Revit 2027 API
TriOrQuadFacet.Normal Property
 A unit normal vector for this facet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Normal { get; }
Public ReadOnly Property Normal As XYZ
	Get
public:
property XYZ^ Normal {
	XYZ^ get ();
}
member Normal : XYZ with get
Property Value
XYZ
See Also
Reference
TriOrQuadFacet Class
Autodesk.Revit.DB Namespace